pyocd/pyOCD/pyocd/debug/svd/data/HC32M458.svd
                <register>
                    <name>DIR0</name>
                    <description>desc DIR0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR1</name>
                    <description>desc DIR1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR2</name>
                    <description>desc DIR2</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR3</name>
                    <description>desc DIR3</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR4</name>
                    <description>desc DIR4</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR5</name>
                    <description>desc DIR5</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR6</name>
                    <description>desc DIR6</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR7</name>
                    <description>desc DIR7</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR8</name>
                    <description>desc DIR8</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR9</name>
                    <description>desc DIR9</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR10</name>
                    <description>desc DIR10</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR11</name>
                    <description>desc DIR11</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR12</name>
                    <description>desc DIR12</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR13</name>
                    <description>desc DIR13</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR14</name>
                    <description>desc DIR14</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIR15</name>
                    <description>desc DIR15</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AD</name>
                            <description>desc AD</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCHS</name>
                            <description>desc PCHS</description>
                            <msb>19</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
