pyocd/pyOCD/pyocd/debug/svd/data/HC32M458.svd
                <register>
                    <name>INTEN</name>
                    <description>desc INTEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMSINTEN</name>
                            <description>desc PWMSINTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPINTEN</name>
                            <description>desc CMPINTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSINTEN</name>
                            <description>desc SYSINTEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN1</name>
                            <description>desc PORTININTEN1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN2</name>
                            <description>desc PORTININTEN2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN3</name>
                            <description>desc PORTININTEN3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN4</name>
                            <description>desc PORTININTEN4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLSSEL</name>
                    <description>desc RLSSEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF0E</resetMask>
                    <fields>
                        <field>
                            <name>PWMRSEL</name>
                            <description>desc PWMRSEL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPRSEL</name>
                            <description>desc CMPRSEL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSRSEL</name>
                            <description>desc SYSRSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL1</name>
                            <description>desc PORTINRSEL1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL2</name>
                            <description>desc PORTINRSEL2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL3</name>
                            <description>desc PORTINRSEL3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL4</name>
                            <description>desc PORTINRSEL4</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EDGESEL</name>
                    <description>desc EDGESEL</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>PORTINEGSEL1</name>
                            <description>desc PORTINEGSEL1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEGSEL2</name>
                            <description>desc PORTINEGSEL2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEGSEL3</name>
                            <description>desc PORTINEGSEL3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEGSEL4</name>
                            <description>desc PORTINEGSEL4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
