pyocd/pyOCD/pyocd/debug/svd/data/HC32M458.svd
                <register>
                    <name>EIRQCR7</name>
                    <description>desc EIRQCR7</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIFR</name>
                    <description>desc EIFR</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EIF0</name>
                            <description>desc EIF0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF1</name>
                            <description>desc EIF1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF2</name>
                            <description>desc EIF2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF3</name>
                            <description>desc EIF3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF4</name>
                            <description>desc EIF4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF5</name>
                            <description>desc EIF5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF6</name>
                            <description>desc EIF6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIF7</name>
                            <description>desc EIF7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIFCR</name>
                    <description>desc EIFCR</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EIFCLR0</name>
                            <description>desc EIFCLR0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR1</name>
                            <description>desc EIFCLR1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR2</name>
                            <description>desc EIFCLR2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR3</name>
                            <description>desc EIFCLR3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR4</name>
                            <description>desc EIFCLR4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR5</name>
                            <description>desc EIFCLR5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR6</name>
                            <description>desc EIFCLR6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIFCLR7</name>
                            <description>desc EIFCLR7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVTER</name>
                    <description>desc EVTER</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EVTE0</name>
                            <description>desc EVTE0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE1</name>
                            <description>desc EVTE1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE2</name>
                            <description>desc EVTE2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE3</name>
                            <description>desc EVTE3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE4</name>
                            <description>desc EVTE4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE5</name>
                            <description>desc EVTE5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE6</name>
                            <description>desc EVTE6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE7</name>
                            <description>desc EVTE7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE8</name>
                            <description>desc EVTE8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE9</name>
                            <description>desc EVTE9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE10</name>
                            <description>desc EVTE10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE11</name>
                            <description>desc EVTE11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE12</name>
                            <description>desc EVTE12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE13</name>
                            <description>desc EVTE13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE14</name>
                            <description>desc EVTE14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE15</name>
                            <description>desc EVTE15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE16</name>
                            <description>desc EVTE16</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE17</name>
                            <description>desc EVTE17</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE18</name>
                            <description>desc EVTE18</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE19</name>
                            <description>desc EVTE19</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE20</name>
                            <description>desc EVTE20</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE21</name>
                            <description>desc EVTE21</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE22</name>
                            <description>desc EVTE22</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE23</name>
                            <description>desc EVTE23</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE24</name>
                            <description>desc EVTE24</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE25</name>
                            <description>desc EVTE25</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE26</name>
                            <description>desc EVTE26</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE27</name>
                            <description>desc EVTE27</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE28</name>
                            <description>desc EVTE28</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE29</name>
                            <description>desc EVTE29</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE30</name>
                            <description>desc EVTE30</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTE31</name>
                            <description>desc EVTE31</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WKEN</name>
                    <description>desc WKEN</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x248F00FF</resetMask>
                    <fields>
                        <field>
                            <name>EIRQWKEN</name>
                            <description>desc EIRQWKEN</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDTWKEN</name>
                            <description>desc SWDTWKEN</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1WKEN</name>
                            <description>desc PVD1WKEN</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2WKEN</name>
                            <description>desc PVD2WKEN</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1WKEN</name>
                            <description>desc CMP1WKEN</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0CMPWKEN</name>
                            <description>desc TMR0CMPWKEN</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXWKEN</name>
                            <description>desc RXWKEN</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP2WKEN</name>
                            <description>desc CMP2WKEN</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
