pyocd/pyOCD/pyocd/debug/svd/data/HC32M458.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PERIC</name>
            <description>desc PERIC</description>
            <groupName>PERIC</groupName>
            <baseAddress>0x40055400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SMC_ENAR</name>
                    <description>desc SMC_ENAR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x2</resetMask>
                    <fields>
                        <field>
                            <name>SMCEN</name>
                            <description>desc SMCEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR_SYNENR</name>
                    <description>desc TMR_SYNENR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F003F</resetMask>
                    <fields>
                        <field>
                            <name>TMR0_1_A</name>
                            <description>desc TMR0_1_A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_1_B</name>
                            <description>desc TMR0_1_B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_2_A</name>
                            <description>desc TMR0_2_A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR0_2_B</name>
                            <description>desc TMR0_2_B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_1</name>
                            <description>desc TMR4_1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR4_2</name>
                            <description>desc TMR4_2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_1</name>
                            <description>desc TMRA_1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_2</name>
                            <description>desc TMRA_2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_3</name>
                            <description>desc TMRA_3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_4</name>
                            <description>desc TMRA_4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA_5</name>
                            <description>desc TMRA_5</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USART1_NFC</name>
                    <description>desc USART1_NFC</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>USASRT1_NFS</name>
                            <description>desc USASRT1_NFS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1_NFE</name>
                            <description>desc USART1_NFE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
