pyocd/pyOCD/pyocd/debug/svd/data/HC32M458.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI1">
            <name>SPI2</name>
            <description>desc SPI</description>
            <groupName>SPI</groupName>
            <baseAddress>0x4001C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>SRAMC</name>
            <description>desc SRAMC</description>
            <groupName>SRAMC</groupName>
            <baseAddress>0x40050800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x34</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>WTCR</name>
                    <description>desc WTCR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7777</resetMask>
                    <fields>
                        <field>
                            <name>SRAM1RWT</name>
                            <description>desc SRAM1RWT</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1WWT</name>
                            <description>desc SRAM1WWT</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMHRWT</name>
                            <description>desc SRAMHRWT</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMHWWT</name>
                            <description>desc SRAMHWWT</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WTPR</name>
                    <description>desc WTPR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WTPRC</name>
                            <description>desc WTPRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WTPRKW</name>
                            <description>desc WTPRKW</description>
                            <msb>7</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKCR</name>
                    <description>desc CKCR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F07</resetMask>
                    <fields>
                        <field>
                            <name>CACHE_ECCOAD</name>
                            <description>desc CACHE_ECCOAD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_ECCOAD</name>
                            <description>desc SRAM1_ECCOAD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMH_ECCOAD</name>
                            <description>desc SRAMH_ECCOAD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CACHE_ECCMOD</name>
                            <description>desc CACHE_ECCMOD</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_ECCMOD</name>
                            <description>desc SRAM1_ECCMOD</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMH_ECCMOD</name>
                            <description>desc SRAMH_ECCMOD</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKPR</name>
                    <description>desc CKPR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKPRC</name>
                            <description>desc CKPRC</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKPRKW</name>
                            <description>desc CKPRKW</description>
                            <msb>7</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKSR</name>
                    <description>desc CKSR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>CACHE_1ERR</name>
                            <description>desc CACHE_1ERR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CACHE_2ERR</name>
                            <description>desc CACHE_2ERR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_1ERR</name>
                            <description>desc SRAM1_1ERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM1_2ERR</name>
                            <description>desc SRAM1_2ERR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMH_1ERR</name>
                            <description>desc SRAMH_1ERR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMH_2ERR</name>
                            <description>desc SRAMH_2ERR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAM1_EIEN</name>
                    <description>desc SRAM1_EIEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>EIEN</name>
                            <description>desc EIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAM1_EIBIT0</name>
                    <description>desc SRAM1_EIBIT0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>SRAM1_EIBIT1</name>
                    <description>desc SRAM1_EIBIT1</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>EIBIT</name>
                            <description>desc EIBIT</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAM1_ECCERRADDR</name>
                    <description>desc SRAM1_ECCERRADDR</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCERRADDR</name>
                            <description>desc ECCERRADDR</description>
                            <msb>16</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMH_EIEN</name>
                    <description>desc SRAMH_EIEN</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>EIEN</name>
                            <description>desc EIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMH_EIBIT0</name>
                    <description>desc SRAMH_EIBIT0</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>SRAMH_EIBIT1</name>
                    <description>desc SRAMH_EIBIT1</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>EIBIT</name>
                            <description>desc EIBIT</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMH_ECCERRADDR</name>
                    <description>desc SRAMH_ECCERRADDR</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFF</resetMask>
                    <fields>
                        <field>
                            <name>ECCERRADDR</name>
                            <description>desc ECCERRADDR</description>
                            <msb>16</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
