pyocd/pyOCD/pyocd/debug/svd/data/HC32M458.svd
                <register>
                    <name>BFCRV</name>
                    <description>desc BFCRV</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000F</resetMask>
                    <fields>
                        <field>
                            <name>OCRSBUFENH</name>
                            <description>desc OCRSBUFENH</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSBUFENL</name>
                            <description>desc OCRSBUFENL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCH</name>
                            <description>desc OCRSLMCH</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCL</name>
                            <description>desc OCRSLMCL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BFCRW</name>
                    <description>desc BFCRW</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3000F</resetMask>
                    <fields>
                        <field>
                            <name>OCRSBUFENH</name>
                            <description>desc OCRSBUFENH</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSBUFENL</name>
                            <description>desc OCRSBUFENL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCH</name>
                            <description>desc OCRSLMCH</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCRSLMCL</name>
                            <description>desc OCRSLMCL</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPCR</name>
                    <description>desc CPCR</description>
                    <addressOffset>0x70</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CPSRLMCP</name>
                            <description>desc CPSRLMCP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPSRLMCZ</name>
                            <description>desc CPSRLMCZ</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PFSRU</name>
                    <description>desc PFSRU</description>
                    <addressOffset>0x82</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARU</name>
                    <description>desc PDARU</description>
                    <addressOffset>0x84</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRU</name>
                    <description>desc PDBRU</description>
                    <addressOffset>0x86</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRV</name>
                    <description>desc PFSRV</description>
                    <addressOffset>0x8A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARV</name>
                    <description>desc PDARV</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRV</name>
                    <description>desc PDBRV</description>
                    <addressOffset>0x8E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PFSRW</name>
                    <description>desc PFSRW</description>
                    <addressOffset>0x92</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDARW</name>
                    <description>desc PDARW</description>
                    <addressOffset>0x94</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDBRW</name>
                    <description>desc PDBRW</description>
                    <addressOffset>0x96</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>POCRU</name>
                    <description>desc POCRU</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMD</name>
                            <description>desc PWMMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCRV</name>
                    <description>desc POCRV</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMD</name>
                            <description>desc PWMMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCRW</name>
                    <description>desc POCRW</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMMD</name>
                            <description>desc PWMMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCCRUH</name>
                    <description>desc SCCRUH</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCCRUL</name>
                    <description>desc SCCRUL</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCCRVH</name>
                    <description>desc SCCRVH</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCCRVL</name>
                    <description>desc SCCRVL</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCCRWH</name>
                    <description>desc SCCRWH</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCCRWL</name>
                    <description>desc SCCRWL</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>SCSRUH</name>
                    <description>desc SCSRUH</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMRUH</name>
                    <description>desc SCMRUH</description>
                    <addressOffset>0xD2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCSRUL</name>
                    <description>desc SCSRUL</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF33F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTOS</name>
                            <description>desc EVTOS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTMS</name>
                            <description>desc EVTMS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTDS</name>
                            <description>desc EVTDS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
